<h1> Exercice 1 </h1>


Vous travaillez dans une entreprise de vente en ligne. Vous avez reçu des données de ventes journalières pour différents produits, réparties sur plusieurs listes. Votre tâche est de consolider ces données dans un DataFrame pour une analyse ultérieure.

1) Créez un DataFrame pandas à partir de ces listes
2) Définissez la colonnes products en tant qu'index
3) affichez les données de la ligne correspondant au prodit "keyboard"
4) Réinitialisez finalement l'index de votre dataframe

In [ ]:
dates = ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02']
products = ['Keyboard', 'Mouse', 'Monitor', 'Mouse']
quantities = [3, 5, 2, 3]
unit_prices = [79.99, 25.50, 199.99, 25.50]

In [9]:
import pandas as pd

In [12]:
all_lists = list(zip(dates, products, quantities, unit_prices))
data = all_lists
data = pd.DataFrame(data, columns=['Date', 'Product', 'Quantity', 'Unit Price'])
df = data.copy()
df

         Date   Product  Quantity  Unit Price
0  2023-01-01  Keyboard         3       79.99
1  2023-01-01     Mouse         5       25.50
2  2023-01-02   Monitor         2      199.99
3  2023-01-02     Mouse         3       25.50

In [13]:
df.set_index('Product', inplace=True)
df

                Date  Quantity  Unit Price
Product
Keyboard  2023-01-01         3       79.99
Mouse     2023-01-01         5       25.50
Monitor   2023-01-02         2      199.99
Mouse     2023-01-02         3       25.50

In [17]:
df.loc[['Keyboard','Monitor'], ['Date','Unit Price']]

                Date  Unit Price
Product
Keyboard  2023-01-01       79.99
Monitor   2023-01-02      199.99

In [20]:
df.reset_index(inplace=True)
df

   index   Product        Date  Quantity  Unit Price
0      0  Keyboard  2023-01-01         3       79.99
1      1     Mouse  2023-01-01         5       25.50
2      2   Monitor  2023-01-02         2      199.99
3      3     Mouse  2023-01-02         3       25.50

<h1> Exercice 2 </h1>

vous devez importer un fichier CSV "products_exercices.csv" contenant des données de produits pour une analyse ultérieure. Le fichier CSV a des spécificités que vous devez prendre en compte lors de l'importation : 
- Ignorez la première ligne du fichier qui est un commentaire.
- Utilisez le caractère séparateur ,.
- Les valeurs null sont représentées par la chaîne "Vide".
- Définissez la colonne product_id comme index du DataFrame.
- Importez uniquement les colonnes products, category, et price et ignorez les autres colonnes.

Extrait du fichier : 

//Ceci est un commentaire à ignorer <br>
product_id,products,category,price,stock <br>
1,Keyboard,Electronics,Vide,45 <br>
2,Mouse,Electronics,29.99,150 <br>
3,Monitor,Vide,199.99,Vide <br>
4,Desk,Furniture,149.99,30

In [24]:
path = r'C:\Users\nmako\Documents\Data-Science-Projects-Repository\Pandas_basic\data\raw\products_exercices.csv' 
data_csv = pd.read_csv(path, sep=',', header=1, index_col='product_id', usecols=['product_id','category','price'])
data_csv

               category   price
product_id
1           Electronics    Vide
2           Electronics   29.99
3                  Vide  199.99
4             Furniture  149.99

In [48]:
data_csv = pd.read_csv( path, 
                       sep=',', 
                       header=1, 
                       index_col='product_id', 
                       usecols=['product_id', 'category', 'price'], 
                       na_values=['Vide']
                        
                    )
data_csv

               category   price
product_id
1           Electronics     NaN
2           Electronics   29.99
3                   NaN  199.99
4             Furniture  149.99

<h1> Exercice 3 </h1>

Vous travaillez pour une entreprise qui reçoit régulièrement des données de clients au format JSON. Les données sont structurées avec un objet parent nommé data, contenant une liste d'objets représentant les informations des clients. Votre tâche est d'importer ces données dans un DataFrame pour analyse et de les exporter en format JSON pour une utilisation ultérieure.

1) Importez les données JSON de clients_exercices.json dans un DataFrame pandas. Assurez-vous de cibler l'objet data qui contient les informations nécessaires.
2) Exportez le DataFrame résultant en un nouveau fichier JSON.

In [ ]:
path_json = r'C:\Users\nmako\Documents\Data-Science-Projects-Repository\Pandas_basic\data\raw\clients_exercices.json'
data_json = pd.read_json(path_json)

                                                data
0  {'client_id': '1', 'name': 'Alice', 'age': 31,...
1  {'client_id': '2', 'name': 'Bob', 'age': 22, '...
2  {'client_id': '3', 'name': 'Charlie', 'age': 3...

In [44]:
cld = pd.json_normalize(data_json['data'])
cld

  client_id     name  age                email
0         1    Alice   31    alice@example.com
1         2      Bob   22      bob@example.com
2         3  Charlie   35  charlie@example.com